Public Attributes | List of all members
API_SkeletonOptions Struct Reference
View Handling
Skeleton drawing options. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_ViewSourceID  | viewSrc
Skeleton view source.
 short  | floorIdx
Skeleton source floor index.
 double  | cutHeight
Cut height (on the source floor).
 short  | floorOffset
Floor offset to the other cutplane.
 double  | cutOffset
Cut height (on the " @c floorIdx + @c floorOffset " floor).
 short  | filler
Reserved for later use.
Detailed Description
Skeleton drawing options.